'''------------------------'''
'''   0123456789'''
test='test привет!'


print(test[0])
print(test[1:3])
print(test[:2])
print(test[2:])

text = "Привет, мир!"
substring = "мир"

# Проверка наличия подстроки
if substring in text:
    print(f'Подстрока "{substring}" найдена в строке.')
else:
    print(f'Подстрока "{substring}" не найдена в строке.')
'''----------------------------------------------------------------------------------------'''


text = "Программирование — это искусство создания программ."
substring = "пр"

# Подсчет количества вхождений подстроки
count = text.count(substring)
print(f'Подстрока "{substring}" встречается в строке {count} раз(а).')

'''----------------------------------------------------------------------------------------'''


#https://letpy.com/handbook/string-methods/