'''
1 Инкапсуляция:

Объединение данных и методов в одном объекте.

Использование _ и __ для ограничения доступа.

2 Наследование:

Создание новых классов на основе существующих.

Дочерние классы наследуют атрибуты и методы родительских классов.

3 Полиморфизм:

Возможность использовать объекты разных классов через единый интерфейс.

Методы с одинаковым именем работают по-разному в разных классах.

4 Абстракция:

Сокрытие сложной реализации.

Использование абстрактных классов и методов.
'''

#https://habr.com/ru/articles/210288/